coocox/Mplib/Toshaba/TMPM37x/TMPM375/cmsis_lib/lib/cmsis_boot/TMPM375.h
/**
 *******************************************************************************
 * @file    TMPM375.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM375' Device Series
 * @version V2.0.2.4 (Tentative)
 * @date    2013/03/19
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2013 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM375
  * @{
  */

#ifndef __TMPM375_H__
#define __TMPM375_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M3 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M3 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M3 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM375 Specific Interrupt Numbers *******************************************************************/
  INTRX0_IRQn                   = 0,         /*!< Serial reception (channel.0)                                */
  INTTX0_IRQn                   = 1,         /*!< Serial transmit (channel.0)                                 */
  INTRX1_IRQn                   = 2,         /*!< Serial reception (channel.1)                                */
  INTTX1_IRQn                   = 3,         /*!< Serial transmit (channel.1)                                 */
  INTVCNB_IRQn                  = 4,         /*!< Vector Engine interrupt B                                   */
  INTEMG1_IRQn                  = 5,         /*!< PMD1 EMG interrupt                                          */
  INTOVV1_IRQn                  = 6,         /*!< PMD1 OVV interrupt                                          */
  INTADBPDB_IRQn                = 7,         /*!< ADCB conversion triggered by PMD1 is finished               */
  INTTB00_IRQn                  = 8,         /*!< 16bit TMRB0 compare match detection 0/ Over flow            */
  INTTB01_IRQn                  = 9,         /*!< 16bit TMRB0 compare match detection 1                       */
  INTTB40_IRQn                  = 10,        /*!< 16bit TMRB4 compare match detection 0/ Over flow            */
  INTTB41_IRQn                  = 11,        /*!< 16bit TMRB4 compare match detection 1                       */
  INTTB50_IRQn                  = 12,        /*!< 16bit TMRB5 compare match detection 0/ Over flow            */
  INTTB51_IRQn                  = 13,        /*!< 16bit TMRB5 compare match detection 1                       */
  INTPMD1_IRQn                  = 14,        /*!< PMD1 PWM interrupt                                          */
  INTCAP00_IRQn                 = 15,        /*!< 16bit TMRB0 input capture 0                                 */
  INTCAP01_IRQn                 = 16,        /*!< 16bit TMRB0 input capture 1                                 */
  INTCAP50_IRQn                 = 17,        /*!< 16bit TMRB5 input capture 0                                 */
  INTCAP51_IRQn                 = 18,        /*!< 16bit TMRB5 input capture 1                                 */
  INT6_IRQn                     = 19,        /*!< Interrupt Pin (PE6/TB3IN//17pin or 19pin)                   */
  INT7_IRQn                     = 20,        /*!< Interrupt Pin (PE7/TB3OUT/18pin or 20pin)                   */
  INTADBCPA_IRQn                = 21,        /*!< ADCB conversion monitoring function interrupt A             */
  INTADBCPB_IRQn                = 22,        /*!< ADCB conversion monitoring function interrupt B             */
  INTADBSFT_IRQn                = 23,        /*!< ADC1 conversion started by software is finished             */
  INTADBTMR_IRQn                = 24,        /*!< ADC1 conversion triggered by timer is finished              */
  INTENC0_IRQn                  = 25,        /*!< Ender input0 interrupt                                      */
  INTTB70_IRQn                  = 26,        /*!< 16bit TMRB7 compare match detection 0 / Over flow           */
  INTTB71_IRQn                  = 27,        /*!< 16bit TMRB7 compare match detection 1                       */
  INTCAP70_IRQn                 = 28,        /*!< 16bit TMRB7 input capture 0                                 */
  INTCAP71_IRQn                 = 29,        /*!< 16bit TMRB7 input capture 1                                 */
  INTC_IRQn                     = 30,        /*!< Interrupt Pin (PJ6/AINB9/74pin or 76 pin)                   */
  INTSBI0_IRQn                  = 31         /*!< Serial Bus Interface0                                       */
} IRQn_Type;

